import { BoostName } from "./types"

export const BOOSTS = [
  [
    "歩兵攻撃力",
    "弓兵攻撃力",
    "騎兵攻撃力",
    // "攻城兵器攻撃力",
    // "罠攻撃力",
    // "歩兵防御力",
    // "弓兵防御力",
    // "騎兵防御力",
    // "攻城兵器防御力",
    // "罠防御力",
  ],
  [
    "歩兵HP",
    "弓兵HP",
    "騎兵HP",
    "攻城兵器HP",
    "罠HP",
    "歩対弓強化ブースト",
    "弓対騎強化ブースト",
    "騎対歩強化ブースト",
  ],
  [
    "軍隊攻撃力",
    "軍隊防御力",
    "軍隊HP",
    "連合軍攻撃力",
    // "城壁防御力"
  ],
  ["攻撃力弱体化", "防御力弱体化", "HP弱体化"],
] as const

export const BOOST_MODIFIERS: Record<BoostName, number> = {
  歩兵攻撃力: 1,
  弓兵攻撃力: 1,
  騎兵攻撃力: 1,
  // 攻城兵器攻撃力: 0,
  // 罠攻撃力: 0,

  // 歩兵防御力: 0,
  // 弓兵防御力: 0,
  // 騎兵防御力: 0,
  // 攻城兵器防御力: 0,
  // 罠防御力: 0,

  歩兵HP: 1,
  弓兵HP: 1,
  騎兵HP: 1,
  攻城兵器HP: 0,
  罠HP: 0,

  歩対弓強化ブースト: 0,
  弓対騎強化ブースト: 0,
  騎対歩強化ブースト: 0,

  軍隊攻撃力: 3,
  軍隊防御力: 0,
  軍隊HP: 3,
  連合軍攻撃力: 3,
  // 城壁防御力: 0,

  攻撃力弱体化: 0,
  防御力弱体化: 0,
  HP弱体化: 0,
} as const
